/* 3장 C프로그램 구성 요소
> 주석 : 코드를 설명하는 글 
> 들여쓰기: 같은 수준의 문장들 왼쪽 끝 들여쓰기
> 전처리기 : #기호로 시작 -> 외부 파일을 포함시키라는 의미의 전처리기
> 헤더파일 중 <stdio.h>는 표준 입출력에 대한 라이브러리 함수의 정의가 들어있는 헤더파일.
-> 합쳐서 #include <stdio.h>
> 함수 : 특정 기능을 수행하는 처리 단계들을 괄호로 묶어서 이름을 붙인 것. 
-> int main(void)에서 int는 함수 출력 타입, main은 함수의 이름, void는 함수의 입력 타입으로 입력이 없다는 뜻. 
> return : 함수를 종료시키면서 값을 반환하는 키워드. 
> 변수: 프로그램이 사용하는 데이터를 일시적으로 저장할 목적으로 사용하는 메모리 공간.
> 자료형 : 변수가 저장할 데이터가 정수인지 실수인지, 아니면 또 다른 어떤 데이터인지를 지정하는 것. -> 정수형, 부동소수점형(실수형), 문자형이 있음.
> 변수 선언 : 컴파일러에게 어떤 타입의 변수가 사용되는지를 미리 알리는 것.
> 식별자 : 변수의 이름은 변수와 변수들을 식별하는 역할을 함. (영문자와 숫자, 밑줄 문자로 구성될 수 있음)
> 키워드 : C언언에서 고유한 의미를 가지고 있는 특별한 단어로 예약어라고도 함.
> 변수의 초기화 : 변수에 초기값을 줄 수 있음.
> 수식 : 피연산자와 연산자로 구성된 식으로 결과값을 가짐. 
> 대입 연산 : 변수에 값을 저장하는 연산
> 라이브러리 함수: 컴파일러가 프로그래머가 사용할 수 있도록 제공하는 함수
> printf() : 모니터에 출력을 하기 위한 표준 출력 함수
> scanf() : 키보드에서의 입력을 받기 위한 표준 입력 함수
> 문자열(string): 문자들을 여러 개 나열한 것
> 형식 지정자 : printf()에서 값을 출력하는 형식을 지정. %d - 정수, %f - 실수(float형), %lf - 실수(double형), %c - 문자(character), %s - 문자열(string)
> 필드폭 : 데이터가 출력되는 필드의 크기를 지정가능. %10d - 필드폭:10 우축정렬, %-10d - 필드폭:10 좌측정렬 (숫자는 디폴트 우측정렬, 문자는 디폴트 좌측정렬)/ %.3f - 소수점 이하 셋째자리
*/

#include <stdio.h>
int main(void)
{
    double num1, num2, num3;
    double sum, avg;

    printf("Enter three decimal numbers: \n");
    scanf("%lf %lf %lf", &num1, &num2, &num3);

    sum = num1 + num2+ num3;
    avg = sum / 3.0;
    
    printf("Sum = %.2lf\n", sum);
    printf("Average = %.2lf", avg);

    return 0;

}